Repository: rrpg/engine
Catalog: locales/*/LC_MESSAGES/message.po
Languages: fr_fr

# ERROR_UNKNOWN_SELECTED_WORLD
source: Unknown selected world
fr_fr: Le monde choisi n'existe pas

# CHOICE_QUESTION
source: Your choice?
fr_fr: Votre choix :

# LOGIN_PROMPT
source: Login:
fr_fr: Identifiant :

# COMMAND_PROMPT
source: Command:
fr_fr: Commande :

# LOOK_COMMAND
source: look
fr_fr: regarder

# TALK_COMMAND
source: talk
fr_fr: demander

# MOVE_COMMAND
source: move
fr_fr: marcher

# ENTER_COMMAND
source: enter
fr_fr: entrer

# EXIT_COMMAND
source: exit
fr_fr: sortir

# TAKE_COMMAND
source: take
fr_fr: prendre

# DROP_COMMAND
source: drop
fr_fr: déposer

# INVENTORY_COMMAND
source: inventory
fr_fr: inventaire

# HELP_COMMAND
source: help
fr_fr: aide

# OPEN_COMMAND
source: open
fr_fr: ouvrir

# QUIT_COMMAND
source: quit
fr_fr: quitter

# ERROR_UNKNOWN_COMMAND
source: Unknown command
fr_fr: Commande inconnue

# ERROR_SIGNUP_NOT_ENOUGH_ARGUMENTS
source: More arguments are required to create a player
fr_fr: Des arguments supplémentaires sont requis pour créer un joueur

# ERROR_SIGNUP_LOGIN_ALREADY_USED
source: This login is already used
fr_fr: Identifiant déjà utilisé

# ERROR_SIGNUP_INVALID_GENDER
source: Invalid gender
fr_fr: Le genre choisi est invalide

# ERROR_SIGNUP_INVALID_SPECIES
source: Invalid species
fr_fr: L'espèce choisie est invalide

source: Gender selection
fr_fr: Choix du sexe

# GENDER_PROMPT
source: Gender:
fr_fr: Sexe :

source: Species selection
fr_fr: Choix de l'espèce

# SPECIES_PROMPT
source: Species:
fr_fr: Espèce :

# PLAYER_CREATION_CONFIRMATION
source: Player created
fr_fr: Le joueur a été créé avec succès

# ERROR_DROP_NO_ITEM_GIVEN
source: What shall I drop?
fr_fr: Que voulez-vous déposer ?

# ERROR_DROP_UNKNOWN_ITEM
source: I have none of those
fr_fr: Objet inconnu

# ERROR_DROP_ITEM_NOT_AVAILABLE
source: I have none of those
fr_fr: Vous ne possédez pas cet objet

# ERROR_DROP_QUANTITY_TOO_HIGH_%s
source: I don't have enough %s to drop
fr_fr: Vous ne possédez pas assez de %s

# DROP_CONFIRMATION_%(quantity)s_%(name)s
source: You drop %(quantity)s %(name)s
fr_fr: Vous déposez %(quantity)s %(name)s

# ERROR_ENTER_NO_PLACE_GIVEN
source: I can't enter into nothing
fr_fr: Où voulez-vous entrer ?

# ERROR_ENTER_PLACE_NOT_AVAILABLE
source: There is no such place here
fr_fr: Le lieu demandé n'est pas où vous vous trouvez

# ENTER_CONFIRMATION
source: You enter.
fr_fr: Vous entrez...

# ERROR_EXIT_NO_PLACE_GIVEN
source: I can't exit out of nothing
fr_fr: D'où voulez-vous sortir ?

# EXIT_CONFIRMATION
source: You are now outside
fr_fr: Vous sortez...

# CHARACTER_TOKEN
source: character name
fr_fr: nom du personnage

# SENTENCE_TOKEN
source: sentence
fr_fr: phrase

# TALK_COMMAND_DESCRIPTION
source: Talk to a character
fr_fr: Parler à un personnage

# MOVE_COMMAND_DESCRIPTION
source: Go to the indicated direction
fr_fr: Se déplacer dans une des directions disponibles

# ENTER_COMMAND_DESCRIPTION
source: Enter in the selected place (if the place is available in the current cell)
fr_fr: Entrer dans un lieu

# EXIT_COMMAND_DESCRIPTION
source: Exit from the selected place (if the current cell is the place exit)
fr_fr: Sortir d'un lieu (la sortie doit se trouver sur la même case que le joueur)

# LOOK_COMMAND_DESCRIPTION
source: List everything which is in the current area (characters, items, neighbour areas...)
fr_fr: Regarder autour de soi

# INVENTORY_COMMAND_DESCRIPTION
source: List the items the player has in his inventory
fr_fr: Lister le contenu de l'inventaire du joueur

# ITEM_NAME_TOKEN
source: item name
fr_fr: objet

# QUANTITY_TOKEN
source: quantity
fr_fr: quantité

# TAKE_COMMAND_DESCRIPTION
source: Take some items on the ground
fr_fr: Ramasser un objet au sol

# DROP_COMMAND_DESCRIPTION
source: Drop some items from your inventory
fr_fr: Déposer un objet par terre

# HELP_COMMAND_DESCRIPTION
source: Display the help menu
fr_fr: Afficher le menu d'aide

# QUIT_COMMAND_DESCRIPTION
source: Quit the game
fr_fr: Quitter le jeu

# AVAILABLE_COMMANDS_TITLE
source: Available commands
fr_fr: Commandes disponibles :

# CURRENT_REGION_%s
source: You are in %s
fr_fr: Vous vous trouver dans %s

# PRESENT_CHARACTERS
source: You see these characters arround:
fr_fr: Vous voyez les personnages suivants :

# AVAILABLE_DIRECTIONS
source: You can go in the following directions:
fr_fr: Vous pouvez aller dans les directions suivantes :

# AVAILABLE_PLACES
source: You see the following places:
fr_fr: Vous pouvez entrer dans les lieux suivants :

# AVAILABLE_ITEMS
source: You see the following items
fr_fr: Vous pouvez ramasser les objets suivants :

# AVAILABLE_ITEMS_CONTAINERS
source: Available containers
fr_fr: Conteneurs d'objets

# ERROR_MOVE_NO_DIRECTION_GIVEN
source: Where shall I go?
fr_fr: Où voulez-vous aller ?

# ERROR_MOVE_INVALID_DIRECTION_%s
source: %s is not a valid direction
fr_fr: La direction %s n'est pas valide

# ERROR_MOVE_DIRECTION_NOT_AVAILABLE
source: I can't go there
fr_fr: Vous ne pouvez pas vous déplacer dans la direction demandée

# MOVE_CONFIRMATION_%s
source: let's go %s
fr_fr: Vous vous déplacez dans la direction %s

# ERROR_OPEN_NO_CONTAINER_PROVIDED
source: A container type must be provided
fr_fr: Un type de conteneur doit être spécifié

source: Items in container %s
fr_fr: %s:

# ERROR_TAKE_NO_ITEM_GIVEN
source: What shall I take?
fr_fr: Que voulez-vous ramasser ?

# ERROR_TAKE_UNKNOWN_ITEM
source: I don't see this here.
fr_fr: Objet inconnu

# ERROR_TAKE_ITEM_NOT_AVAILABLE
source: I don't see this here.
fr_fr: Vous ne voyez pas cet objet ici

# TAKE_CONFIRMATION_%(quantity)s_%(name)s
source: You take %(quantity)s %(name)s
fr_fr: Vous ramassez %(quantity)s %(name)s

# ERROR_TALK_NO_CHARACTER_GIVEN
source: Who must I talk to?
fr_fr: À qui voulez-vous parler ?

# ERROR_TALK_NO_SENTENCE_GIVEN
source: What must I say?
fr_fr: Que voulez-vous demander ?

# ERROR_TALK_UNKNOWN_CHARACTER
source: Unknow character
fr_fr: À qui voulez-vous parler ?

# ERROR_TALK_UNKNOWN_SENTENCE
source: What?
fr_fr: Pardon ?

# DIRECTION_KEY_NORTH
source: north
fr_fr: nord

# DIRECTION_KEY_EAST
source: east
fr_fr: est

# DIRECTION_KEY_SOUTH
source: south
fr_fr: sud

# DIRECTION_KEY_WEST
source: west
fr_fr: ouest

# AREA_TYPE_DUNGEON
source: dungeon
fr_fr: donjon

# AREA_TYPE_LAND
source: land
fr_fr: terres

# ERROR_UNKNOWN_ITEM_CONTAINER_TYPE_LABEL
source: This container type does not exist
fr_fr: Type de conteneur inconnu

# ERROR_CONTAINER_NOT_AVAILABLE
source: There is no container with this type here
fr_fr: Il n'y a pas de conteneur de ce type ici

# ERROR_MULTIPLE_CONTAINERS_AVAILABLE
source: There are more than one container with this type here, an explicit index is required
fr_fr: Il y a plusieurs conteneurs de ce type ici, un index est necessaire.

# PLACE_TYPE_DUNGEON
source: dungeon
fr_fr: donjon

# ERROR_UNKNOWN_PLACE_TYPE
source: Unknown place type
fr_fr: Type de lieu inconnu

# ERROR_PLACE_GENERATION
source: An error occured during the place loading
fr_fr: Une erreur est survenue lors du chargement du lieu...

# ERROR_CONNECT_INVALID_CREDENTIALS
source: Invalid login
fr_fr: Identifiant ou mot de passe incorrect
